tutorials/pitzDailyFaceZoneAverage/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1000;

deltaT          1;

writeControl    timeStep;

writeInterval   1000;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    avgP
    {
        type                faceZoneAverageDST;
        libs                ("libdataCenterFunctionObjectsDST.so");

        faceZones           (faceZoneA faceZoneB);
        field               p;
    }
    
    avgU
    {
        type                faceZoneAverageDST;
        libs                ("libdataCenterFunctionObjectsDST.so");

        faceZones           (faceZoneA faceZoneB);
        field               U;
    }
}

// ************************************************************************* //
