tutorials/pitzDailyFaceZoneAverage/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    faceSetA;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (-0.0035233 -0.0002365 -1)(-0.00321 0.025806 1);
        }
    }

    {
        name    faceZoneA;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        sourceInfo
        {
            faceSet faceSetA;
        }
    }
    
    
    
    {
        name    faceSetB;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (0.1995 -0.026 -1)(0.2 0.026 1);
        }
    }

    {
        name    faceZoneB;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        sourceInfo
        {
            faceSet faceSetB;
        }
    }

);

// ************************************************************************* //
